app/views/graphs/hello.html.erb

SELECT COUNT(*) AS count_all, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(`date`, INTERVAL 0 HOUR), '+00:00', 'Europe/Brussels'), '%Y-%m-%d 00:00:00'), 'Europe/Brussels', '+00:00'), INTERVAL 0 HOUR) AS day, hyper AS hyper, hypo AS hypo FROM `glycemies` WHERE `glycemies`.`user_id` = 2 AND (`date` IS NOT NULL) GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(`date`, INTERVAL 0 HOUR), '+00:00', 'Europe/Brussels'), '%Y-%m-%d 00:00:00'), 'Europe/Brussels', '+00:00'), INTERVAL 0 HOUR), hyper, hypo
---
<h2>Number of tests per day</h2>
<%= area_chart Glycemy.where(:user_id => current_user.id).group_by_day(:date, last: 7).count %>

SELECT AVG(`glycemies`.`valeur`) AS average_valeur, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(`date`, INTERVAL 0 HOUR), '+00:00', 'Europe/Brussels'), '%Y-%m-%d 00:00:00'), 'Europe/Brussels', '+00:00'), INTERVAL 0 HOUR) AS day FROM `glycemies` WHERE `glycemies`.`user_id` = 2 AND (`date` IS NOT NULL) GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(`date`, INTERVAL 0 HOUR), '+00:00', 'Europe/Brussels'), '%Y-%m-%d 00:00:00'), 'Europe/Brussels', '+00:00'), INTERVAL 0 HOUR)
---

<%= area_chart Glycemy.where(:user_id => current_user.id).group_by_day(:date, last: 7).average(:valeur), {library: {hAxis: {title: "Date", format: 'd MMM y'}, vAxis: {title: "Average"}}} %>