app/views/graphs/hello.html.erb

SELECT COUNT(*) AS count_all, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(`created_at`, INTERVAL 0 HOUR), '+00:00', 'Europe/Brussels'), '%Y-%m-%d 00:00:00'), 'Europe/Brussels', '+00:00'), INTERVAL 0 HOUR) AS day FROM `glycemies` WHERE (`created_at` IS NOT NULL) GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(`created_at`, INTERVAL 0 HOUR), '+00:00', 'Europe/Brussels'), '%Y-%m-%d 00:00:00'), 'Europe/Brussels', '+00:00'), INTERVAL 0 HOUR)
---
<%= pie_chart({"Football" => 10, "Basketball" => 5}) %>
<%= line_chart Glycemy.group_by_day(:created_at).count %>