app/controllers/articles_controller.rb

  def index
    #@articles = Article.all
    @articles = Article.where(:user_id => current_user.id).page(params[:page]).per(10)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 2

  def create
    @article = Article.new(article_params)
    @user = current_user
    @article.set_user!(current_user)
    @article.user_id = current_user.id
    respond_to do |format|
      if @article.save
---
INSERT INTO `articles` (`created_at`, `post`, `updated_at`, `user_id`) VALUES ('2015-05-10 10:33:50', 'Le Lorem Ipsum est simplement du faux texte employé dans la composition et la mise en page avant impression. Le Lorem Ipsum est le faux texte standard de l\'imprimerie depuis les années 1500, quand un peintre anonyme assembla ensemble des morceaux de texte pour réaliser un livre spécimen de polices de texte. Il n\'a pas fait que survivre cinq siècles, mais s\'est aussi adapté à la bureautique informatique, sans que son contenu n\'en soit modifié. Il a été popularisé dans les années 1960 grâce à la vente de feuilles Letraset contenant des passages du Lorem Ipsum, et, plus récemment, par son inclusion dans des applications de mise en page de texte, comme Aldus PageMaker', '2015-05-10 10:33:50', 2)

    def set_article
      @article = Article.find(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1