app/controllers/glycemies_controller.rb

SELECT COUNT(*) AS count_all, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(`created_at`, INTERVAL 0 HOUR), '+00:00', 'Europe/Brussels'), '%Y-%m-%d 00:00:00'), 'Europe/Brussels', '+00:00'), INTERVAL 0 HOUR) AS day FROM `glycemies` WHERE `glycemies`.`user_id` = 2 AND (`created_at` IS NOT NULL) GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(`created_at`, INTERVAL 0 HOUR), '+00:00', 'Europe/Brussels'), '%Y-%m-%d 00:00:00'), 'Europe/Brussels', '+00:00'), INTERVAL 0 HOUR)
SELECT `glycemies`.* FROM `glycemies` WHERE `glycemies`.`user_id` = 2 GROUP BY valeur
---
  def index
    #@glycemies = Glycemy.all
    @glycemies = Glycemy.where(:user_id => current_user.id).page(params[:page]).per(10)

INSERT INTO `glycemies` (`created_at`, `date`, `note`, `updated_at`, `users_id`, `valeur`) VALUES ('2015-05-01 16:43:01', '2015-05-01', 'avant repas', '2015-05-01 16:43:01', 1, 100)
---
  def create
    @glycemy = Glycemy.new(glycemy_params)
    @glycemy.save

DELETE FROM `glycemies` WHERE `glycemies`.`id` = 9
---
  def destroy
    @glycemy.destroy

SELECT `glycemies`.* FROM `glycemies` WHERE `glycemies`.`id` = 9 LIMIT 1
---
    def set_glycemy
      @glycemy = Glycemy.find(params[:id])