app/controllers/insulines_controller.rb

  def index
    #@insulines = Insuline.all
    @insulines = Insuline.where(:user_id => current_user.id)
---
SELECT `insulines`.* FROM `insulines` WHERE `insulines`.`user_id` = 2

  def create
    @insuline = Insuline.new(insuline_params)
    @insuline.save
---
INSERT INTO `insulines` (`created_at`, `date`, `name`, `note`, `unit`, `updated_at`) VALUES ('2015-05-11 13:54:59', '2015-05-11', 'levemir', 'test', 24, '2015-05-11 13:54:59')

  def destroy
    @insuline.destroy
---
DELETE FROM `insulines` WHERE `insulines`.`id` = 4

    def set_insuline
      @insuline = Insuline.find(params[:id])
---
SELECT `insulines`.* FROM `insulines` WHERE `insulines`.`id` = 4 LIMIT 1