app/controllers/users_controller.rb

  def index
    @users = User.all.page(params[:page]).per(10)
---
SELECT `users`.* FROM `users`

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `password`, `updated_at`) VALUES ('2015-04-26 09:59:06', 'b_hautier@hotmail.com', 'aze', '2015-04-26 09:59:06')

    def set_user
      @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1